particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
            if (s_bleInstance.gattClientOnDataRecCb != NULL) {
                msg.type = BLE_GATT_CLIENT_DATA_RECEIVED;
                msg.handler = (evt_handler_t)s_bleInstance.gattClientOnDataRecCb;
                msg.arg.gattClientOnDataRecEvt.version = 0x01;
                msg.arg.gattClientOnDataRecEvt.conn_handle = event->evt.gattc_evt.conn_handle;
                msg.arg.gattClientOnDataRecEvt.peer_attr_handle = event->evt.gattc_evt.params.hvx.handle;
                msg.arg.gattClientOnDataRecEvt.offset = 0;
                msg.arg.gattClientOnDataRecEvt.data_len = event->evt.gattc_evt.params.hvx.len;
                memcpy(msg.arg.gattClientOnDataRecEvt.data, event->evt.gattc_evt.params.hvx.data, msg.arg.gattClientOnDataRecEvt.data_len);
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            }
        } break;

        case BLE_GATTC_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: timeout, conn handle: %d, source: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.timeout.src);

            // Disconnect on GATT Client timeout event.
            ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: system attribute is missing.");

            // No persistent system attributes
            const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: exchange ATT MTU request.");
            LOG_DEBUG(TRACE, "Effective Client RX MTU: %d.", event->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu);

            ret = sd_ble_gatts_exchange_mtu_reply(event->evt.gatts_evt.conn_handle, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_exchange_mtu_reply() failed: %u", (unsigned)ret);
            }

            LOG_DEBUG(TRACE, "Reply with Server RX MTU: %d.", NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
        } break;

        case BLE_GATTS_EVT_WRITE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: write characteristic.");

            // TODO: deal with different write commands.

            if (s_bleInstance.gattServerOnDataRecCb != NULL) {
                msg.type = BLE_GATT_SERVER_DATA_RECEIVED;
                msg.handler = (evt_handler_t)s_bleInstance.gattServerOnDataRecCb;
                msg.arg.gattServerOnDataRecEvt.version = 0x01;
                msg.arg.gattServerOnDataRecEvt.conn_handle = event->evt.gatts_evt.conn_handle;
                msg.arg.gattServerOnDataRecEvt.attr_handle = event->evt.gatts_evt.params.write.handle;
                msg.arg.gattServerOnDataRecEvt.offset = event->evt.gatts_evt.params.write.offset;
                msg.arg.gattServerOnDataRecEvt.data_len = event->evt.gatts_evt.params.write.len;
                memcpy(msg.arg.gattServerOnDataRecEvt.data, event->evt.gatts_evt.params.write.data, msg.arg.gattServerOnDataRecEvt.data_len);
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            }
        } break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: notification sent.");
        } break;

        case BLE_GATTS_EVT_HVC: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: indication confirmed.");
            s_bleInstance.indConfirmed = true;
        } break;

        case BLE_GATTS_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: timeout, source: %d.", event->evt.gatts_evt.params.timeout.src);

            // Disconnect on GATT Server timeout event.
            ret = sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        default: {
            LOG_DEBUG(TRACE, "Unhandled BLE event: %u", (unsigned)event->header.evt_id);
        } break;
    }
}

static os_thread_return_t handleBleEventThread(void* param) {
    while (1) {
        HalBleEvtMsg_t msg;
        if (!os_queue_take(s_bleInstance.evtQueue, &msg, CONCURRENT_WAIT_FOREVER, NULL)) {
            // Try retrieving 128-bits service or characteristic UUID before dispatching this event.
            if (   msg.type == BLE_GATT_CLIENT_SERVICES_DISCOVERED
                || msg.type == BLE_GATT_CLIENT_CHARACTERISTICS_DISCOVERED
                || msg.type == BLE_GATT_CLIENT_DESCRIPTORS_DISCOVERED) {
                if (msg.type == BLE_GATT_CLIENT_SERVICES_DISCOVERED) {
                    hal_ble_gatt_client_on_services_discovered_evt_t *svcDiscEvt = (hal_ble_gatt_client_on_services_discovered_evt_t*)&msg.arg;
                    for (uint8_t i = 0; i < svcDiscEvt->count; i++) {
                        if (svcDiscEvt->services[i].uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
                            ret_code_t ret = sd_ble_gattc_read(svcDiscEvt->conn_handle, svcDiscEvt->services[i].start_handle, 0);
                            if (ret != NRF_SUCCESS) {
                                LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
                                break;
                            }
                            s_bleInstance.discovery.currIndex = i;
                            if (os_semaphore_take(s_bleInstance.semaphore, 2000, false)) {
                                LOG(ERROR, "os_semaphore_take() timeout.");
                                break;
                            }
                        }
                    }
                }
                else if (msg.type == BLE_GATT_CLIENT_CHARACTERISTICS_DISCOVERED) {
                    hal_ble_gatt_client_on_characteristics_discovered_evt_t* charDiscEvt = (hal_ble_gatt_client_on_characteristics_discovered_evt_t*)&msg.arg;
                    for (uint8_t i = 0; i < charDiscEvt->count; i++) {
                        if (charDiscEvt->characteristics[i].uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
                            ret_code_t ret = sd_ble_gattc_read(charDiscEvt->conn_handle, charDiscEvt->characteristics[i].decl_handle, 0);
                            if (ret != NRF_SUCCESS) {
                                LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
                                break;
                            }
                            s_bleInstance.discovery.currIndex = i;
                            if (os_semaphore_take(s_bleInstance.semaphore, 2000, false)) {
                                LOG(ERROR, "os_semaphore_take() timeout.");
                                break;
                            }
                        }
                    }
                }
                s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_IDLE;
                s_bleInstance.discovering = false;
            }

            if (msg.handler != NULL) {
                msg.handler(&msg.arg);
            }
        }
        else {
            LOG(ERROR, "BLE event thread exited.");
            break;
        }
    }

    os_thread_exit(s_bleInstance.evtThread);
}


/**********************************************
 * Particle BLE APIs
 */
bool ble_stack_is_initialized(void) {
    return s_bleInstance.initialized;
}

int ble_stack_init(void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());

    /* The SoftDevice has been enabled in core_hal.c */
    LOG_DEBUG(TRACE, "ble_stack_init().");

    if (!s_bleInstance.initialized) {
        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t ramStart = 0;
        ret_code_t ret = nrf_sdh_ble_default_cfg_set(BLE_CONN_CFG_TAG, &ramStart);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "nrf_sdh_ble_default_cfg_set() failed: %u", (unsigned)ret);
            return sysError(ret);
        }
        LOG_DEBUG(TRACE, "RAM start: 0x%08x", (unsigned)ramStart);

