particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
        // Enable the stack
        ret = nrf_sdh_ble_enable(&ramStart);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "nrf_sdh_ble_enable() failed: %u", (unsigned)ret);
            return sysError(ret);
        }

        s_bleInstance.initialized = true;

        // Register a handler for BLE events.
        NRF_SDH_BLE_OBSERVER(bleObserver, BLE_OBSERVER_PRIO, isrProcessBleEvent, nullptr);

        s_bleInstance.connHandle = BLE_INVALID_CONN_HANDLE;

        // Configure an advertising set to obtain an advertising handle.
        int error = ble_gap_set_advertising_parameters(&s_bleInstance.advParams);
        if (error != SYSTEM_ERROR_NONE) {
            return error;
        }

        // Set the default TX Power
        ret = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, s_bleInstance.advHandle, s_bleInstance.txPower);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_tx_power_set() failed: %u", (unsigned)ret);
            return sysError(ret);
        }
        s_bleInstance.txPower = 0;

        // Select internal antenna by default
        ble_select_antenna(BLE_ANT_INTERNAL);

        if (os_semaphore_create(&s_bleInstance.semaphore, 1, 0)) {
            LOG(ERROR, "os_semaphore_create() failed");
            return SYSTEM_ERROR_INTERNAL;
        }

        if (os_queue_create(&s_bleInstance.evtQueue, sizeof(HalBleEvtMsg_t), BLE_EVENT_QUEUE_ITEM_COUNT, NULL)) {
            LOG(ERROR, "os_queue_create() failed");
            os_semaphore_destroy(s_bleInstance.semaphore);
            return SYSTEM_ERROR_NO_MEMORY;
        }

        if (os_thread_create(&s_bleInstance.evtThread, "BLE Event Thread", OS_THREAD_PRIORITY_NETWORK, handleBleEventThread, NULL, BLE_EVENT_THREAD_STACK_SIZE)) {
            LOG(ERROR, "os_thread_create() failed");
            os_queue_destroy(s_bleInstance.evtQueue, NULL);
            os_semaphore_destroy(s_bleInstance.semaphore);
            return SYSTEM_ERROR_INTERNAL;
        }

        if (os_timer_create(&s_bleInstance.connParamsUpdateTimer, BLE_CONN_PARAMS_UPDATE_DELAY_MS, connParamsUpdateTimerCb, NULL, true, NULL)) {
            LOG(ERROR, "os_timer_create() failed.");
        }

        return SYSTEM_ERROR_NONE;
    }
    else {
        return SYSTEM_ERROR_INVALID_STATE;
    }
}

int ble_select_antenna(hal_ble_antenna_type_t antenna) {
    // FIXME: mesh SoMs specific configurations
    HAL_Pin_Mode(ANTSW1, OUTPUT);
#if (PLATFORM_ID == PLATFORM_XENON) || (PLATFORM_ID == PLATFORM_ARGON)
    HAL_Pin_Mode(ANTSW2, OUTPUT);
#endif

    if (antenna == BLE_ANT_EXTERNAL) {
#if (PLATFORM_ID == PLATFORM_ARGON)
        HAL_GPIO_Write(ANTSW1, 1);
        HAL_GPIO_Write(ANTSW2, 0);
#elif (PLATFORM_ID == PLATFORM_BORON)
        HAL_GPIO_Write(ANTSW1, 0);
#else
        HAL_GPIO_Write(ANTSW1, 0);
        HAL_GPIO_Write(ANTSW2, 1);
#endif
    }
    else {
#if (PLATFORM_ID == PLATFORM_ARGON)
        HAL_GPIO_Write(ANTSW1, 0);
        HAL_GPIO_Write(ANTSW2, 1);
#elif (PLATFORM_ID == PLATFORM_BORON)
        HAL_GPIO_Write(ANTSW1, 1);
#else
        HAL_GPIO_Write(ANTSW1, 1);
        HAL_GPIO_Write(ANTSW2, 0);
#endif
    }

    return SYSTEM_ERROR_NONE;
}

int ble_gap_set_callback_on_advertising_stopped(ble_gap_on_advertising_stopped_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gapOnAdvStoppedCb = callback;
    return SYSTEM_ERROR_NONE;
}

int ble_gap_set_callback_on_scan_result(ble_gap_on_scan_result_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gapOnScanResultCb = callback;
    return SYSTEM_ERROR_NONE;
}

int ble_gap_set_callback_on_scan_stopped(ble_gap_on_scan_stopped_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gapOnScanStoppedCb = callback;
    return SYSTEM_ERROR_NONE;
}

int ble_gap_set_callback_on_connected(ble_gap_on_connected_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gapOnConnectedCb = callback;
    return SYSTEM_ERROR_NONE;
}

int ble_gap_set_callback_on_disconnected(ble_gap_on_disconnected_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gapOnDisconnectedCb = callback;
    return SYSTEM_ERROR_NONE;
}

int ble_gap_set_callback_on_connection_parameters_updated(ble_gap_on_connection_parameters_updated_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gapOnConnParamsUpdatedCb = callback;
    return SYSTEM_ERROR_NONE;
}

int ble_gatt_server_set_callback_on_data_received(ble_gatt_server_on_data_received_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gattServerOnDataRecCb = callback;
    return SYSTEM_ERROR_NONE;
}

int ble_gatt_client_set_callback_on_services_discovered(ble_gatt_client_on_services_discovered_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gattClientOnServicesDiscoveredCb = callback;
    return SYSTEM_ERROR_NONE;
}

int ble_gatt_client_set_callback_on_characteristics_discovered(ble_gatt_client_on_characteristics_discovered_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gattClientOnCharacteristicsDiscoveredCb = callback;
    return SYSTEM_ERROR_NONE;
}

int ble_gatt_client_set_callback_on_descriptors_discovered(ble_gatt_client_on_descriptors_discovered_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gattClientOnDescriptorsDiscoveredCb = callback;
    return SYSTEM_ERROR_NONE;
}

int ble_gatt_client_set_callback_on_data_received(ble_gatt_client_on_data_received_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.gattClientOnDataRecCb = callback;
    return SYSTEM_ERROR_NONE;
}


/**********************************************
 * BLE GAP APIs
 */
int ble_gap_set_device_address(hal_ble_address_t const* address) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_device_address().");

    if (address == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (address->addr_type != BLE_SIG_ADDR_TYPE_PUBLIC && address->addr_type != BLE_SIG_ADDR_TYPE_RANDOM_STATIC) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (s_bleInstance.advertising || s_bleInstance.scanning || s_bleInstance.connecting) {
        // The identity address cannot be changed while advertising, scanning or creating a connection.
        return SYSTEM_ERROR_INVALID_STATE;
    }

    ble_gap_addr_t localAddr;
    localAddr.addr_id_peer = false;
    localAddr.addr_type    = address->addr_type;
    memcpy(localAddr.addr, address->addr, BLE_SIG_ADDR_LEN);

