particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    // It is invalid to change advertising set parameters while advertising.
    if (s_bleInstance.advertising) {
        int err = ble_gap_stop_advertising();
        if (err != SYSTEM_ERROR_NONE) {
            return err;
        }
        advPending = true;
    }

    ble_gap_adv_params_t bleGapAdvParams;
    memset(&bleGapAdvParams, 0x00, sizeof(ble_gap_adv_params_t));

    bleGapAdvParams.properties.type             = adv_params->type;
    bleGapAdvParams.properties.include_tx_power = false; // FIXME: for extended advertising packet
    bleGapAdvParams.p_peer_addr                 = NULL;
    bleGapAdvParams.interval                    = adv_params->interval;
    bleGapAdvParams.duration                    = adv_params->timeout;
    bleGapAdvParams.filter_policy               = adv_params->filter_policy;
    bleGapAdvParams.primary_phy                 = BLE_GAP_PHY_1MBPS;

    LOG_DEBUG(TRACE, "BLE advertising interval: %.3fms, timeout: %dms.",
            bleGapAdvParams.interval*0.625, bleGapAdvParams.duration*10);

    // Make sure the advertising data and scan response data is consistent.
    ble_gap_adv_data_t bleGapAdvData;
    bleGapAdvData.adv_data.p_data      = s_bleInstance.advData;
    bleGapAdvData.adv_data.len         = s_bleInstance.advDataLen;
    bleGapAdvData.scan_rsp_data.p_data = s_bleInstance.scanRespData;
    bleGapAdvData.scan_rsp_data.len    = s_bleInstance.scanRespDataLen;

    ret = sd_ble_gap_adv_set_configure(&s_bleInstance.advHandle, &bleGapAdvData, &bleGapAdvParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_set_configure() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    if (advPending) {
        advPending = false;
        return ble_gap_start_advertising();
    }

    memcpy(&s_bleInstance.advParams, adv_params, sizeof(hal_ble_advertising_parameters_t));

    return sysError(ret);
}

int ble_gap_set_advertising_data(uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_advertising_data().");

    if ((data == NULL) || (len < 3)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    return setAdvData(data, len, BLE_ADV_DATA_ADVERTISING);
}

int ble_gap_set_scan_response_data(uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_scan_response_data().");

    if (data == NULL) {
        len = 0;
    }

    return setAdvData(data, len, BLE_ADV_DATA_SCAN_RESPONSE);
}

int ble_gap_start_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_start_advertising().");

    if (s_bleInstance.advertising) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_adv_start(s_bleInstance.advHandle, BLE_CONN_CFG_TAG);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_bleInstance.advertising = true;
        return SYSTEM_ERROR_NONE;
    }
}

int ble_gap_stop_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_stop_advertising().");

    if (!s_bleInstance.advertising) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_adv_stop(s_bleInstance.advHandle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_stop() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_bleInstance.advertising = false;
        return SYSTEM_ERROR_NONE;
    }
}

bool ble_gap_is_advertising(void) {
    return s_bleInstance.advertising;
}

int ble_gap_set_scan_parameters(hal_ble_scan_parameters_t* scan_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_scan_parameters().");

    if (scan_params == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (scan_params->interval < BLE_GAP_SCAN_INTERVAL_MIN) {
        scan_params->interval = BLE_GAP_SCAN_INTERVAL_MIN;
    }
    if (scan_params->interval > BLE_GAP_SCAN_INTERVAL_MAX) {
        scan_params->interval = BLE_GAP_SCAN_INTERVAL_MAX;
    }
    if (scan_params->window < BLE_GAP_SCAN_WINDOW_MIN) {
        scan_params->window = BLE_GAP_SCAN_WINDOW_MIN;
    }
    if (scan_params->window > BLE_GAP_SCAN_WINDOW_MAX) {
        scan_params->window = BLE_GAP_SCAN_WINDOW_MAX;
    }

    memcpy(&s_bleInstance.scanParams, scan_params, sizeof(hal_ble_scan_parameters_t));

    return SYSTEM_ERROR_NONE;
}

int ble_gap_start_scan(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_start_scan().");

    sd_ble_gap_scan_stop();
    s_bleInstance.scanning = false;

    ble_gap_scan_params_t bleGapScanParams;
    fromHalScanParams(&s_bleInstance.scanParams, &bleGapScanParams);

    LOG_DEBUG(TRACE, "| interval(ms)   window(ms)   timeout(ms) |");
    LOG_DEBUG(TRACE, "  %.3f        %.3f      %d",
            bleGapScanParams.interval*0.625,
            bleGapScanParams.window*0.625,
            bleGapScanParams.timeout*10);

    ret_code_t ret = sd_ble_gap_scan_start(&bleGapScanParams, &s_bleScanData);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    s_bleInstance.scanning = true;

    return SYSTEM_ERROR_NONE;
}

bool ble_gap_is_scanning(void) {
    return s_bleInstance.scanning;
}

int ble_gap_stop_scan(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_stop_scan().");

    ret_code_t ret = sd_ble_gap_scan_stop();
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

